# GetActiveDesignOptionId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DesignOption..::..GetActiveDesignOptionId Method
DesignOption Class See Also
---
Gets the active design option id for the current design option set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static ElementId GetActiveDesignOptionId(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetActiveDesignOptionId ( _
	document As Document _
) As ElementId
```

Visual C++
---
```text
public:
static ElementId^ GetActiveDesignOptionId(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
# ### Return Value
The active design option id. It can be invalid id if there is no active design option in the model.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DesignOption Class
Autodesk.Revit.DB Namespace